## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_network_security_group.poc-network-security-grp-ne will be created
  + resource "azurerm_network_security_group" "poc-network-security-grp-ne" {
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "poc-netwowrksecurity-grp-ne"
      + resource_group_name = "poc-netwowrkrg-ne"
      + security_rule       = (known after apply)
    }

  # azurerm_resource_group.poc-network-ne will be created
  + resource "azurerm_resource_group" "poc-network-ne" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "poc-netwowrkrg-ne"
    }

  # azurerm_virtual_network.poc-vnet will be created
  + resource "azurerm_virtual_network" "poc-vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = [
          + "10.0.0.4",
          + "10.0.0.5",
        ]
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "poc-vnet-ne"
      + resource_group_name = "poc-netwowrkrg-ne"
      + subnet              = [
          + {
              + address_prefix = "10.0.1.0/24"
              + id             = (known after apply)
              + name           = "subnet1"
                # (1 unchanged attribute hidden)
            },
          + {
              + address_prefix = "10.0.2.0/24"
              + id             = (known after apply)
              + name           = "subnet2"
              + security_group = (known after apply)
            },
        ]
      + tags                = {
          + "environment" = "Production"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>